/* eslint-disable react/no-unescaped-entities */
import Head from "next/head"
import Image from "next/image"
import { useSelector } from "react-redux"
import Breadcrumbs from "@/components/Breadcrumbs"
import Link from "next/link"

export default function Index() {
   const settings = useSelector((state) => state.settings.value)

   const categories = {
         id: 0,
         name: "الشروط العامة",
         items:[
            {
               title: "شروط الاتفاقية",
               desc:`شركة وسام النجاح لا تملك أي ضمانات، سواء كانت صريحة أو ضمنية بخصوص محتوى الموقع، وتملك الحق بالتنازل عن جميع الضمانات لأقصى حد مسموح به في القانون. تقع عليك مسؤولية دخولك واستخدامك للبرمجيات وغيرها من المواد على موقع وسام النجاح أو من خلاله. شركة وسام النجاح لا تقدم أية ضمانات حول موثوقية أو دقة أو خلو مثل هذه البرامج من الفيروسات.تبعاً للقانون المعمول به، فإنه لا تتحمل شركة وسام النجاح و/أو الجهات المرخصة لها و/أو الموردين و/أو مقدمي الخدمات، تحت أي ظرف من الظروف، أي مسؤولية مباشرة أو غير مباشرة، عرضية، خاصة، تأديبية، تعويضات تبعية أو رادعة لأي نوع من الأضرار (بما في ذلك على سبيل المثال لا الحصر خسارة الأرباح، المدخرات المفقودة أو الإيرادات أو فقدان أو تلف البيانات أو المعلومات) التي تنشأ عن أي وسيلة متعلقة باستخدام موقع وسام النجاح أو عدم القدرة على استخدامه، سواءً كان ذلك بسبب الإخلال بالعقد، الضرر، الإهمال، فعالية المنتجات أو غيرها من الأسباب، وحتى لو تم إعلامك عن إمكانية حدوث مثل هذه الأضرار. وهذا يتضمن أي معلومات، منتجات أو خدمات يتم الحصول عليها على الموقع أو من خلاله، باستثناء النقل المقدم من شركات الطيران والمتعلق بأي نوع من التذاكر التي تم الحصول عليها عبر استخدام محرك الحجز المقدم في الموقع، والتي تخضع لشروط النقل والاتفاقيات الدولية المعمول بها.`
            },
            {
               title: "تعديل الشروط",
               desc:`شركة وسام النجاح لا تملك أي ضمانات، سواء كانت صريحة أو ضمنية بخصوص محتوى الموقع، وتملك الحق بالتنازل عن جميع الضمانات لأقصى حد مسموح به في القانون. تقع عليك مسؤولية دخولك واستخدامك للبرمجيات وغيرها من المواد على موقع وسام النجاح أو من خلاله. شركة وسام النجاح لا تقدم أية ضمانات حول موثوقية أو دقة أو خلو مثل هذه البرامج من الفيروسات.تبعاً للقانون المعمول به، فإنه لا تتحمل شركة وسام النجاح و/أو الجهات المرخصة لها و/أو الموردين و/أو مقدمي الخدمات، تحت أي ظرف من الظروف، أي مسؤولية مباشرة أو غير مباشرة، عرضية، خاصة، تأديبية، تعويضات تبعية أو رادعة لأي نوع من الأضرار (بما في ذلك على سبيل المثال لا الحصر خسارة الأرباح، المدخرات المفقودة أو الإيرادات أو فقدان أو تلف البيانات أو المعلومات) التي تنشأ عن أي وسيلة متعلقة باستخدام موقع وسام النجاح أو عدم القدرة على استخدامه، سواءً كان ذلك بسبب الإخلال بالعقد، الضرر، الإهمال، فعالية المنتجات أو غيرها من الأسباب، وحتى لو تم إعلامك عن إمكانية حدوث مثل هذه الأضرار. وهذا يتضمن أي معلومات، منتجات أو خدمات يتم الحصول عليها على الموقع أو من خلاله، باستثناء النقل المقدم من شركات الطيران والمتعلق بأي نوع من التذاكر التي تم الحصول عليها عبر استخدام محرك الحجز المقدم في الموقع، والتي تخضع لشروط النقل والاتفاقيات الدولية المعمول بها.`
            },
            {
               title: "جاهزية الموقع",
               desc:`شركة وسام النجاح لا تملك أي ضمانات، سواء كانت صريحة أو ضمنية بخصوص محتوى الموقع، وتملك الحق بالتنازل عن جميع الضمانات لأقصى حد مسموح به في القانون. تقع عليك مسؤولية دخولك واستخدامك للبرمجيات وغيرها من المواد على موقع وسام النجاح أو من خلاله. شركة وسام النجاح لا تقدم أية ضمانات حول موثوقية أو دقة أو خلو مثل هذه البرامج من الفيروسات.تبعاً للقانون المعمول به، فإنه لا تتحمل شركة وسام النجاح و/أو الجهات المرخصة لها و/أو الموردين و/أو مقدمي الخدمات، تحت أي ظرف من الظروف، أي مسؤولية مباشرة أو غير مباشرة، عرضية، خاصة، تأديبية، تعويضات تبعية أو رادعة لأي نوع من الأضرار (بما في ذلك على سبيل المثال لا الحصر خسارة الأرباح، المدخرات المفقودة أو الإيرادات أو فقدان أو تلف البيانات أو المعلومات) التي تنشأ عن أي وسيلة متعلقة باستخدام موقع وسام النجاح أو عدم القدرة على استخدامه، سواءً كان ذلك بسبب الإخلال بالعقد، الضرر، الإهمال، فعالية المنتجات أو غيرها من الأسباب، وحتى لو تم إعلامك عن إمكانية حدوث مثل هذه الأضرار. وهذا يتضمن أي معلومات، منتجات أو خدمات يتم الحصول عليها على الموقع أو من خلاله، باستثناء النقل المقدم من شركات الطيران والمتعلق بأي نوع من التذاكر التي تم الحصول عليها عبر استخدام محرك الحجز المقدم في الموقع، والتي تخضع لشروط النقل والاتفاقيات الدولية المعمول بها.`
            },
            {
               title: "إخلاء المسؤولية عن الضمانات وتحديد المسؤولية",
               desc:`شركة وسام النجاح لا تملك أي ضمانات، سواء كانت صريحة أو ضمنية بخصوص محتوى الموقع، وتملك الحق بالتنازل عن جميع الضمانات لأقصى حد مسموح به في القانون. تقع عليك مسؤولية دخولك واستخدامك للبرمجيات وغيرها من المواد على موقع وسام النجاح أو من خلاله. شركة وسام النجاح لا تقدم أية ضمانات حول موثوقية أو دقة أو خلو مثل هذه البرامج من الفيروسات.تبعاً للقانون المعمول به، فإنه لا تتحمل شركة وسام النجاح و/أو الجهات المرخصة لها و/أو الموردين و/أو مقدمي الخدمات، تحت أي ظرف من الظروف، أي مسؤولية مباشرة أو غير مباشرة، عرضية، خاصة، تأديبية، تعويضات تبعية أو رادعة لأي نوع من الأضرار (بما في ذلك على سبيل المثال لا الحصر خسارة الأرباح، المدخرات المفقودة أو الإيرادات أو فقدان أو تلف البيانات أو المعلومات) التي تنشأ عن أي وسيلة متعلقة باستخدام موقع وسام النجاح أو عدم القدرة على استخدامه، سواءً كان ذلك بسبب الإخلال بالعقد، الضرر، الإهمال، فعالية المنتجات أو غيرها من الأسباب، وحتى لو تم إعلامك عن إمكانية حدوث مثل هذه الأضرار. وهذا يتضمن أي معلومات، منتجات أو خدمات يتم الحصول عليها على الموقع أو من خلاله، باستثناء النقل المقدم من شركات الطيران والمتعلق بأي نوع من التذاكر التي تم الحصول عليها عبر استخدام محرك الحجز المقدم في الموقع، والتي تخضع لشروط النقل والاتفاقيات الدولية المعمول بها.`
            },
            {
               title: "الاستخدام المقبول",
               desc:`شركة وسام النجاح لا تملك أي ضمانات، سواء كانت صريحة أو ضمنية بخصوص محتوى الموقع، وتملك الحق بالتنازل عن جميع الضمانات لأقصى حد مسموح به في القانون. تقع عليك مسؤولية دخولك واستخدامك للبرمجيات وغيرها من المواد على موقع وسام النجاح أو من خلاله. شركة وسام النجاح لا تقدم أية ضمانات حول موثوقية أو دقة أو خلو مثل هذه البرامج من الفيروسات.تبعاً للقانون المعمول به، فإنه لا تتحمل شركة وسام النجاح و/أو الجهات المرخصة لها و/أو الموردين و/أو مقدمي الخدمات، تحت أي ظرف من الظروف، أي مسؤولية مباشرة أو غير مباشرة، عرضية، خاصة، تأديبية، تعويضات تبعية أو رادعة لأي نوع من الأضرار (بما في ذلك على سبيل المثال لا الحصر خسارة الأرباح، المدخرات المفقودة أو الإيرادات أو فقدان أو تلف البيانات أو المعلومات) التي تنشأ عن أي وسيلة متعلقة باستخدام موقع وسام النجاح أو عدم القدرة على استخدامه، سواءً كان ذلك بسبب الإخلال بالعقد، الضرر، الإهمال، فعالية المنتجات أو غيرها من الأسباب، وحتى لو تم إعلامك عن إمكانية حدوث مثل هذه الأضرار. وهذا يتضمن أي معلومات، منتجات أو خدمات يتم الحصول عليها على الموقع أو من خلاله، باستثناء النقل المقدم من شركات الطيران والمتعلق بأي نوع من التذاكر التي تم الحصول عليها عبر استخدام محرك الحجز المقدم في الموقع، والتي تخضع لشروط النقل والاتفاقيات الدولية المعمول بها.`
            },
            {
               title: "حقوق الطبع والنشر والعلامات التجارية",
               desc:`شركة وسام النجاح لا تملك أي ضمانات، سواء كانت صريحة أو ضمنية بخصوص محتوى الموقع، وتملك الحق بالتنازل عن جميع الضمانات لأقصى حد مسموح به في القانون. تقع عليك مسؤولية دخولك واستخدامك للبرمجيات وغيرها من المواد على موقع وسام النجاح أو من خلاله. شركة وسام النجاح لا تقدم أية ضمانات حول موثوقية أو دقة أو خلو مثل هذه البرامج من الفيروسات.تبعاً للقانون المعمول به، فإنه لا تتحمل شركة وسام النجاح و/أو الجهات المرخصة لها و/أو الموردين و/أو مقدمي الخدمات، تحت أي ظرف من الظروف، أي مسؤولية مباشرة أو غير مباشرة، عرضية، خاصة، تأديبية، تعويضات تبعية أو رادعة لأي نوع من الأضرار (بما في ذلك على سبيل المثال لا الحصر خسارة الأرباح، المدخرات المفقودة أو الإيرادات أو فقدان أو تلف البيانات أو المعلومات) التي تنشأ عن أي وسيلة متعلقة باستخدام موقع وسام النجاح أو عدم القدرة على استخدامه، سواءً كان ذلك بسبب الإخلال بالعقد، الضرر، الإهمال، فعالية المنتجات أو غيرها من الأسباب، وحتى لو تم إعلامك عن إمكانية حدوث مثل هذه الأضرار. وهذا يتضمن أي معلومات، منتجات أو خدمات يتم الحصول عليها على الموقع أو من خلاله، باستثناء النقل المقدم من شركات الطيران والمتعلق بأي نوع من التذاكر التي تم الحصول عليها عبر استخدام محرك الحجز المقدم في الموقع، والتي تخضع لشروط النقل والاتفاقيات الدولية المعمول بها.`
            },
            {
               title: "شروط الهاتف المحمول",
               desc:`شركة وسام النجاح لا تملك أي ضمانات، سواء كانت صريحة أو ضمنية بخصوص محتوى الموقع، وتملك الحق بالتنازل عن جميع الضمانات لأقصى حد مسموح به في القانون. تقع عليك مسؤولية دخولك واستخدامك للبرمجيات وغيرها من المواد على موقع وسام النجاح أو من خلاله. شركة وسام النجاح لا تقدم أية ضمانات حول موثوقية أو دقة أو خلو مثل هذه البرامج من الفيروسات.تبعاً للقانون المعمول به، فإنه لا تتحمل شركة وسام النجاح و/أو الجهات المرخصة لها و/أو الموردين و/أو مقدمي الخدمات، تحت أي ظرف من الظروف، أي مسؤولية مباشرة أو غير مباشرة، عرضية، خاصة، تأديبية، تعويضات تبعية أو رادعة لأي نوع من الأضرار (بما في ذلك على سبيل المثال لا الحصر خسارة الأرباح، المدخرات المفقودة أو الإيرادات أو فقدان أو تلف البيانات أو المعلومات) التي تنشأ عن أي وسيلة متعلقة باستخدام موقع وسام النجاح أو عدم القدرة على استخدامه، سواءً كان ذلك بسبب الإخلال بالعقد، الضرر، الإهمال، فعالية المنتجات أو غيرها من الأسباب، وحتى لو تم إعلامك عن إمكانية حدوث مثل هذه الأضرار. وهذا يتضمن أي معلومات، منتجات أو خدمات يتم الحصول عليها على الموقع أو من خلاله، باستثناء النقل المقدم من شركات الطيران والمتعلق بأي نوع من التذاكر التي تم الحصول عليها عبر استخدام محرك الحجز المقدم في الموقع، والتي تخضع لشروط النقل والاتفاقيات الدولية المعمول بها.`
            },
            {
               title: "استخدام بطاقة الائتمان",
               desc:`شركة وسام النجاح لا تملك أي ضمانات، سواء كانت صريحة أو ضمنية بخصوص محتوى الموقع، وتملك الحق بالتنازل عن جميع الضمانات لأقصى حد مسموح به في القانون. تقع عليك مسؤولية دخولك واستخدامك للبرمجيات وغيرها من المواد على موقع وسام النجاح أو من خلاله. شركة وسام النجاح لا تقدم أية ضمانات حول موثوقية أو دقة أو خلو مثل هذه البرامج من الفيروسات.تبعاً للقانون المعمول به، فإنه لا تتحمل شركة وسام النجاح و/أو الجهات المرخصة لها و/أو الموردين و/أو مقدمي الخدمات، تحت أي ظرف من الظروف، أي مسؤولية مباشرة أو غير مباشرة، عرضية، خاصة، تأديبية، تعويضات تبعية أو رادعة لأي نوع من الأضرار (بما في ذلك على سبيل المثال لا الحصر خسارة الأرباح، المدخرات المفقودة أو الإيرادات أو فقدان أو تلف البيانات أو المعلومات) التي تنشأ عن أي وسيلة متعلقة باستخدام موقع وسام النجاح أو عدم القدرة على استخدامه، سواءً كان ذلك بسبب الإخلال بالعقد، الضرر، الإهمال، فعالية المنتجات أو غيرها من الأسباب، وحتى لو تم إعلامك عن إمكانية حدوث مثل هذه الأضرار. وهذا يتضمن أي معلومات، منتجات أو خدمات يتم الحصول عليها على الموقع أو من خلاله، باستثناء النقل المقدم من شركات الطيران والمتعلق بأي نوع من التذاكر التي تم الحصول عليها عبر استخدام محرك الحجز المقدم في الموقع، والتي تخضع لشروط النقل والاتفاقيات الدولية المعمول بها.`
            },
         ]
      };
   return (
      <>
         <Head>
            <title>سياسة الخصوصية</title>
            <meta
               name="viewport"
               content="width=device-width, initial-scale=1"
            />
            <meta
               name="description"
               content={settings.meta_description}
            />
            <meta property="og:title" content="سياسة الخصوصية" />
            <meta property="og:url" content="https://last-delta.vercel.app/privacy-policy" />
            <meta name="keywords" content={settings.keywords} />
            <meta
               property="og:description"
               content={settings.meta_description}
            />
            <meta name="twitter:title" content="سياسة الخصوصية" />
            <meta
               name="twitter:description"
               content={settings.meta_description}
            />
         </Head>
         <div className="hidden md:block w-full bg-secondary h-36 md:h-40"></div>
         <div className="w-full h-[50vh] relative overflow-hidden flex">
            <Image src={"https://d2poqm5pskresc.cloudfront.net/wp-content/uploads/2019/11/Privacy-Policy.jpg"} alt="daleel" fill className='object-cover' />
            <div className="w-full h-full relative z-10 bg-gradient-to-t from-black/75 to-transparent text-white py-4 mt-auto">
               <div className="container h-full flex items-center justify-center">
                  <h1 className="text-xl md:text-3xl">سياسة الخصوصية</h1>
               </div>
            </div>
         </div>
         <div className="container dark:text-white">
            <div className="border-b dark:border-gray-700">
               <Breadcrumbs list={[{ title: "سياسة الخصوصية" }]} />
            </div>
            <h2 className="mt-8">لأننا نهتم بحقوقك، نرجو منك الاطلاع بدقة على هذه الشروط والأحكام قبل استخدام الموقع.</h2>
            <p className="text-sm">يشير موقع <Link href="https://elnagahtravels.com/" className="text-blue-500">https://elnagahtravels.com/</Link> إلى ("وسام النجاح" أو "شركة وسام النجاح" أو "المتجر الإلكتروني" الخاص بشركة وسام النجاح، والمذكور في جميع السياسات، الشروط والأحكام والأسئلة المتكررة)، والذي يشمل: موقع الجوال، تطبيقات الهواتف الذكية لنظام الأيفون، الأندرويد، الويندوز. إن وسام النجاح هي شركة تابعة لمجموعة "سيرا"، وتأسست في المملكة العربية السعودية.</p>
            <div className="">
               {categories.items.map((item, i) => {
                  return (
                     <div key={i} className={`my-10 dark:border-gray-700 ${i != 0 ? "border-t" : "border-none"}`}>
                        <h2 className="text-xl my-4">{item.title}</h2>
                        <p className="text-sm text-justify text-gray-500 dark:text-gray-400">{item.desc}</p>
                     </div>
                  )
               })}
            </div>
         </div>
      </>
   )
}
