/* eslint-disable react/no-unescaped-entities */
import Head from "next/head"
import Image from "next/image"
import { useSelector } from "react-redux"
import Breadcrumbs from "@/components/Breadcrumbs"
import Slider from "react-slick";
import "slick-carousel/slick/slick.css";
import "slick-carousel/slick/slick-theme.css";
import { useEffect, useState } from "react"
import { FontAwesomeIcon } from "@fortawesome/react-fontawesome"
import { faAngleUp } from "@fortawesome/free-solid-svg-icons"

const Accordion = ({ title, items }) => {
   const [open, setOpen] = useState(false)
   return (
      <div className="rounded-lg border-gray-300 shadow-md overflow-hidden mb-8">
         <div onClick={() => setOpen(!open)} className="flex cursor-pointer justify-between items-center p-4 bg-gray-200 dark:bg-gray-700 dark:text-white">
            <h3>{title}</h3>
            <FontAwesomeIcon icon={faAngleUp} className={`transition duration-500 ${open ? "rotate-180" : "rotate-0"}`} />
         </div>
         <div className={`px-4 bg-gray-100 dark:bg-gray-800 dark:text-white shadow-lg overflow-hidden transition-[max-height] duration-1000 delay-0 ${open ? " max-h-[5000px]" : "max-h-0"}`}>
            {items.map((item, index) => (
               <div className="my-6" key={index}>
                  <h4 className="mb-4">{item.title}</h4>
                  <p className="text-xs md:text-sm leading-5 text-gray-600 dark:text-gray-300">{item.desc}</p>
               </div>
            ))}
         </div>
      </div>
   )
}

export default function Index({ questions }) {
   const [id, setId] = useState(0)
   const settings = useSelector((state) => state.settings.value)
   useEffect(() => {
      console.log(questions);
   }, [])

   const categories = [
      {
         id: 0,
         name: "الطيران",
         items: [
            {
               title: "مسائل متعلقة بالحجز",
               items: [
                  {
                     title: "ما هي التذكرة الالكترونية ؟",
                     desc: `التذاكر الإلكترونية هي التذاكر التي يتم فيها تخزين تفاصيل بيانات الحجز والتي تحتوي على (اسم ورقم جواز ومسار رحلة وتفاصيل الدفع الخاصة بكل مسافر) بشكل آمن في نظام شركة الطيران للحجز، دون الحاجة إلى تسليم أو استلام تذاكر ورقية مما يوفر سهولة الاستخدام والسرعة في عمليات الحجز و المزيد من المرونة في تعديل الحجز أو إلغائه. يتعين على المسافر طباعة ايصال التذكرة الإلكترونية التي يتم ارسالها على البريد الالكتروني، واصطحابها مع جواز السفر عند دخول المطار وإبرازها عند إتمام إجراءات السفر.`
                  },
                  {
                     title: "ما هي التذكرة الالكترونية ؟",
                     desc: `التذاكر الإلكترونية هي التذاكر التي يتم فيها تخزين تفاصيل بيانات الحجز والتي تحتوي على (اسم ورقم جواز ومسار رحلة وتفاصيل الدفع الخاصة بكل مسافر) بشكل آمن في نظام شركة الطيران للحجز، دون الحاجة إلى تسليم أو استلام تذاكر ورقية مما يوفر سهولة الاستخدام والسرعة في عمليات الحجز و المزيد من المرونة في تعديل الحجز أو إلغائه. يتعين على المسافر طباعة ايصال التذكرة الإلكترونية التي يتم ارسالها على البريد الالكتروني، واصطحابها مع جواز السفر عند دخول المطار وإبرازها عند إتمام إجراءات السفر.`
                  },
                  {
                     title: "ما هي التذكرة الالكترونية ؟",
                     desc: `التذاكر الإلكترونية هي التذاكر التي يتم فيها تخزين تفاصيل بيانات الحجز والتي تحتوي على (اسم ورقم جواز ومسار رحلة وتفاصيل الدفع الخاصة بكل مسافر) بشكل آمن في نظام شركة الطيران للحجز، دون الحاجة إلى تسليم أو استلام تذاكر ورقية مما يوفر سهولة الاستخدام والسرعة في عمليات الحجز و المزيد من المرونة في تعديل الحجز أو إلغائه. يتعين على المسافر طباعة ايصال التذكرة الإلكترونية التي يتم ارسالها على البريد الالكتروني، واصطحابها مع جواز السفر عند دخول المطار وإبرازها عند إتمام إجراءات السفر.`
                  },
               ],
            },
            {
               title: "إنجاز إجراءات السفر",
               items: [
                  {
                     title: "ما هي التذكرة الالكترونية ؟",
                     desc: `التذاكر الإلكترونية هي التذاكر التي يتم فيها تخزين تفاصيل بيانات الحجز والتي تحتوي على (اسم ورقم جواز ومسار رحلة وتفاصيل الدفع الخاصة بكل مسافر) بشكل آمن في نظام شركة الطيران للحجز، دون الحاجة إلى تسليم أو استلام تذاكر ورقية مما يوفر سهولة الاستخدام والسرعة في عمليات الحجز و المزيد من المرونة في تعديل الحجز أو إلغائه. يتعين على المسافر طباعة ايصال التذكرة الإلكترونية التي يتم ارسالها على البريد الالكتروني، واصطحابها مع جواز السفر عند دخول المطار وإبرازها عند إتمام إجراءات السفر.`
                  },
                  {
                     title: "ما هي التذكرة الالكترونية ؟",
                     desc: `التذاكر الإلكترونية هي التذاكر التي يتم فيها تخزين تفاصيل بيانات الحجز والتي تحتوي على (اسم ورقم جواز ومسار رحلة وتفاصيل الدفع الخاصة بكل مسافر) بشكل آمن في نظام شركة الطيران للحجز، دون الحاجة إلى تسليم أو استلام تذاكر ورقية مما يوفر سهولة الاستخدام والسرعة في عمليات الحجز و المزيد من المرونة في تعديل الحجز أو إلغائه. يتعين على المسافر طباعة ايصال التذكرة الإلكترونية التي يتم ارسالها على البريد الالكتروني، واصطحابها مع جواز السفر عند دخول المطار وإبرازها عند إتمام إجراءات السفر.`
                  },
                  {
                     title: "ما هي التذكرة الالكترونية ؟",
                     desc: `التذاكر الإلكترونية هي التذاكر التي يتم فيها تخزين تفاصيل بيانات الحجز والتي تحتوي على (اسم ورقم جواز ومسار رحلة وتفاصيل الدفع الخاصة بكل مسافر) بشكل آمن في نظام شركة الطيران للحجز، دون الحاجة إلى تسليم أو استلام تذاكر ورقية مما يوفر سهولة الاستخدام والسرعة في عمليات الحجز و المزيد من المرونة في تعديل الحجز أو إلغائه. يتعين على المسافر طباعة ايصال التذكرة الإلكترونية التي يتم ارسالها على البريد الالكتروني، واصطحابها مع جواز السفر عند دخول المطار وإبرازها عند إتمام إجراءات السفر.`
                  },
               ],
            },
            {
               title: "تصحيح الأسماء",
               items: [
                  {
                     title: "ما هي التذكرة الالكترونية ؟",
                     desc: `التذاكر الإلكترونية هي التذاكر التي يتم فيها تخزين تفاصيل بيانات الحجز والتي تحتوي على (اسم ورقم جواز ومسار رحلة وتفاصيل الدفع الخاصة بكل مسافر) بشكل آمن في نظام شركة الطيران للحجز، دون الحاجة إلى تسليم أو استلام تذاكر ورقية مما يوفر سهولة الاستخدام والسرعة في عمليات الحجز و المزيد من المرونة في تعديل الحجز أو إلغائه. يتعين على المسافر طباعة ايصال التذكرة الإلكترونية التي يتم ارسالها على البريد الالكتروني، واصطحابها مع جواز السفر عند دخول المطار وإبرازها عند إتمام إجراءات السفر.`
                  },
                  {
                     title: "ما هي التذكرة الالكترونية ؟",
                     desc: `التذاكر الإلكترونية هي التذاكر التي يتم فيها تخزين تفاصيل بيانات الحجز والتي تحتوي على (اسم ورقم جواز ومسار رحلة وتفاصيل الدفع الخاصة بكل مسافر) بشكل آمن في نظام شركة الطيران للحجز، دون الحاجة إلى تسليم أو استلام تذاكر ورقية مما يوفر سهولة الاستخدام والسرعة في عمليات الحجز و المزيد من المرونة في تعديل الحجز أو إلغائه. يتعين على المسافر طباعة ايصال التذكرة الإلكترونية التي يتم ارسالها على البريد الالكتروني، واصطحابها مع جواز السفر عند دخول المطار وإبرازها عند إتمام إجراءات السفر.`
                  },
                  {
                     title: "ما هي التذكرة الالكترونية ؟",
                     desc: `التذاكر الإلكترونية هي التذاكر التي يتم فيها تخزين تفاصيل بيانات الحجز والتي تحتوي على (اسم ورقم جواز ومسار رحلة وتفاصيل الدفع الخاصة بكل مسافر) بشكل آمن في نظام شركة الطيران للحجز، دون الحاجة إلى تسليم أو استلام تذاكر ورقية مما يوفر سهولة الاستخدام والسرعة في عمليات الحجز و المزيد من المرونة في تعديل الحجز أو إلغائه. يتعين على المسافر طباعة ايصال التذكرة الإلكترونية التي يتم ارسالها على البريد الالكتروني، واصطحابها مع جواز السفر عند دخول المطار وإبرازها عند إتمام إجراءات السفر.`
                  },
               ],
            },
            {
               title: "تغيير الحجز",
               items: [
                  {
                     title: "ما هي التذكرة الالكترونية ؟",
                     desc: `التذاكر الإلكترونية هي التذاكر التي يتم فيها تخزين تفاصيل بيانات الحجز والتي تحتوي على (اسم ورقم جواز ومسار رحلة وتفاصيل الدفع الخاصة بكل مسافر) بشكل آمن في نظام شركة الطيران للحجز، دون الحاجة إلى تسليم أو استلام تذاكر ورقية مما يوفر سهولة الاستخدام والسرعة في عمليات الحجز و المزيد من المرونة في تعديل الحجز أو إلغائه. يتعين على المسافر طباعة ايصال التذكرة الإلكترونية التي يتم ارسالها على البريد الالكتروني، واصطحابها مع جواز السفر عند دخول المطار وإبرازها عند إتمام إجراءات السفر.`
                  },
                  {
                     title: "ما هي التذكرة الالكترونية ؟",
                     desc: `التذاكر الإلكترونية هي التذاكر التي يتم فيها تخزين تفاصيل بيانات الحجز والتي تحتوي على (اسم ورقم جواز ومسار رحلة وتفاصيل الدفع الخاصة بكل مسافر) بشكل آمن في نظام شركة الطيران للحجز، دون الحاجة إلى تسليم أو استلام تذاكر ورقية مما يوفر سهولة الاستخدام والسرعة في عمليات الحجز و المزيد من المرونة في تعديل الحجز أو إلغائه. يتعين على المسافر طباعة ايصال التذكرة الإلكترونية التي يتم ارسالها على البريد الالكتروني، واصطحابها مع جواز السفر عند دخول المطار وإبرازها عند إتمام إجراءات السفر.`
                  },
                  {
                     title: "ما هي التذكرة الالكترونية ؟",
                     desc: `التذاكر الإلكترونية هي التذاكر التي يتم فيها تخزين تفاصيل بيانات الحجز والتي تحتوي على (اسم ورقم جواز ومسار رحلة وتفاصيل الدفع الخاصة بكل مسافر) بشكل آمن في نظام شركة الطيران للحجز، دون الحاجة إلى تسليم أو استلام تذاكر ورقية مما يوفر سهولة الاستخدام والسرعة في عمليات الحجز و المزيد من المرونة في تعديل الحجز أو إلغائه. يتعين على المسافر طباعة ايصال التذكرة الإلكترونية التي يتم ارسالها على البريد الالكتروني، واصطحابها مع جواز السفر عند دخول المطار وإبرازها عند إتمام إجراءات السفر.`
                  },
               ],
            },
         ]
      },
      {
         id: 1,
         name: "الفنادق",
         items: [
            {
               title: "مسائل متعلقة بالحجز",
               items: [
                  {
                     title: "ما هي التذكرة الالكترونية ؟",
                     desc: `التذاكر الإلكترونية هي التذاكر التي يتم فيها تخزين تفاصيل بيانات الحجز والتي تحتوي على (اسم ورقم جواز ومسار رحلة وتفاصيل الدفع الخاصة بكل مسافر) بشكل آمن في نظام شركة الطيران للحجز، دون الحاجة إلى تسليم أو استلام تذاكر ورقية مما يوفر سهولة الاستخدام والسرعة في عمليات الحجز و المزيد من المرونة في تعديل الحجز أو إلغائه. يتعين على المسافر طباعة ايصال التذكرة الإلكترونية التي يتم ارسالها على البريد الالكتروني، واصطحابها مع جواز السفر عند دخول المطار وإبرازها عند إتمام إجراءات السفر.`
                  },
                  {
                     title: "ما هي التذكرة الالكترونية ؟",
                     desc: `التذاكر الإلكترونية هي التذاكر التي يتم فيها تخزين تفاصيل بيانات الحجز والتي تحتوي على (اسم ورقم جواز ومسار رحلة وتفاصيل الدفع الخاصة بكل مسافر) بشكل آمن في نظام شركة الطيران للحجز، دون الحاجة إلى تسليم أو استلام تذاكر ورقية مما يوفر سهولة الاستخدام والسرعة في عمليات الحجز و المزيد من المرونة في تعديل الحجز أو إلغائه. يتعين على المسافر طباعة ايصال التذكرة الإلكترونية التي يتم ارسالها على البريد الالكتروني، واصطحابها مع جواز السفر عند دخول المطار وإبرازها عند إتمام إجراءات السفر.`
                  },
                  {
                     title: "ما هي التذكرة الالكترونية ؟",
                     desc: `التذاكر الإلكترونية هي التذاكر التي يتم فيها تخزين تفاصيل بيانات الحجز والتي تحتوي على (اسم ورقم جواز ومسار رحلة وتفاصيل الدفع الخاصة بكل مسافر) بشكل آمن في نظام شركة الطيران للحجز، دون الحاجة إلى تسليم أو استلام تذاكر ورقية مما يوفر سهولة الاستخدام والسرعة في عمليات الحجز و المزيد من المرونة في تعديل الحجز أو إلغائه. يتعين على المسافر طباعة ايصال التذكرة الإلكترونية التي يتم ارسالها على البريد الالكتروني، واصطحابها مع جواز السفر عند دخول المطار وإبرازها عند إتمام إجراءات السفر.`
                  },
               ],
            },
            {
               title: "إنجاز إجراءات السفر",
               items: [
                  {
                     title: "ما هي التذكرة الالكترونية ؟",
                     desc: `التذاكر الإلكترونية هي التذاكر التي يتم فيها تخزين تفاصيل بيانات الحجز والتي تحتوي على (اسم ورقم جواز ومسار رحلة وتفاصيل الدفع الخاصة بكل مسافر) بشكل آمن في نظام شركة الطيران للحجز، دون الحاجة إلى تسليم أو استلام تذاكر ورقية مما يوفر سهولة الاستخدام والسرعة في عمليات الحجز و المزيد من المرونة في تعديل الحجز أو إلغائه. يتعين على المسافر طباعة ايصال التذكرة الإلكترونية التي يتم ارسالها على البريد الالكتروني، واصطحابها مع جواز السفر عند دخول المطار وإبرازها عند إتمام إجراءات السفر.`
                  },
                  {
                     title: "ما هي التذكرة الالكترونية ؟",
                     desc: `التذاكر الإلكترونية هي التذاكر التي يتم فيها تخزين تفاصيل بيانات الحجز والتي تحتوي على (اسم ورقم جواز ومسار رحلة وتفاصيل الدفع الخاصة بكل مسافر) بشكل آمن في نظام شركة الطيران للحجز، دون الحاجة إلى تسليم أو استلام تذاكر ورقية مما يوفر سهولة الاستخدام والسرعة في عمليات الحجز و المزيد من المرونة في تعديل الحجز أو إلغائه. يتعين على المسافر طباعة ايصال التذكرة الإلكترونية التي يتم ارسالها على البريد الالكتروني، واصطحابها مع جواز السفر عند دخول المطار وإبرازها عند إتمام إجراءات السفر.`
                  },
                  {
                     title: "ما هي التذكرة الالكترونية ؟",
                     desc: `التذاكر الإلكترونية هي التذاكر التي يتم فيها تخزين تفاصيل بيانات الحجز والتي تحتوي على (اسم ورقم جواز ومسار رحلة وتفاصيل الدفع الخاصة بكل مسافر) بشكل آمن في نظام شركة الطيران للحجز، دون الحاجة إلى تسليم أو استلام تذاكر ورقية مما يوفر سهولة الاستخدام والسرعة في عمليات الحجز و المزيد من المرونة في تعديل الحجز أو إلغائه. يتعين على المسافر طباعة ايصال التذكرة الإلكترونية التي يتم ارسالها على البريد الالكتروني، واصطحابها مع جواز السفر عند دخول المطار وإبرازها عند إتمام إجراءات السفر.`
                  },
                  {
                     title: "ما هي التذكرة الالكترونية ؟",
                     desc: `التذاكر الإلكترونية هي التذاكر التي يتم فيها تخزين تفاصيل بيانات الحجز والتي تحتوي على (اسم ورقم جواز ومسار رحلة وتفاصيل الدفع الخاصة بكل مسافر) بشكل آمن في نظام شركة الطيران للحجز، دون الحاجة إلى تسليم أو استلام تذاكر ورقية مما يوفر سهولة الاستخدام والسرعة في عمليات الحجز و المزيد من المرونة في تعديل الحجز أو إلغائه. يتعين على المسافر طباعة ايصال التذكرة الإلكترونية التي يتم ارسالها على البريد الالكتروني، واصطحابها مع جواز السفر عند دخول المطار وإبرازها عند إتمام إجراءات السفر.`
                  },
               ],
            },
            {
               title: "تصحيح الأسماء",
               items: [
                  {
                     title: "ما هي التذكرة الالكترونية ؟",
                     desc: `التذاكر الإلكترونية هي التذاكر التي يتم فيها تخزين تفاصيل بيانات الحجز والتي تحتوي على (اسم ورقم جواز ومسار رحلة وتفاصيل الدفع الخاصة بكل مسافر) بشكل آمن في نظام شركة الطيران للحجز، دون الحاجة إلى تسليم أو استلام تذاكر ورقية مما يوفر سهولة الاستخدام والسرعة في عمليات الحجز و المزيد من المرونة في تعديل الحجز أو إلغائه. يتعين على المسافر طباعة ايصال التذكرة الإلكترونية التي يتم ارسالها على البريد الالكتروني، واصطحابها مع جواز السفر عند دخول المطار وإبرازها عند إتمام إجراءات السفر.`
                  },
                  {
                     title: "ما هي التذكرة الالكترونية ؟",
                     desc: `التذاكر الإلكترونية هي التذاكر التي يتم فيها تخزين تفاصيل بيانات الحجز والتي تحتوي على (اسم ورقم جواز ومسار رحلة وتفاصيل الدفع الخاصة بكل مسافر) بشكل آمن في نظام شركة الطيران للحجز، دون الحاجة إلى تسليم أو استلام تذاكر ورقية مما يوفر سهولة الاستخدام والسرعة في عمليات الحجز و المزيد من المرونة في تعديل الحجز أو إلغائه. يتعين على المسافر طباعة ايصال التذكرة الإلكترونية التي يتم ارسالها على البريد الالكتروني، واصطحابها مع جواز السفر عند دخول المطار وإبرازها عند إتمام إجراءات السفر.`
                  },
                  {
                     title: "ما هي التذكرة الالكترونية ؟",
                     desc: `التذاكر الإلكترونية هي التذاكر التي يتم فيها تخزين تفاصيل بيانات الحجز والتي تحتوي على (اسم ورقم جواز ومسار رحلة وتفاصيل الدفع الخاصة بكل مسافر) بشكل آمن في نظام شركة الطيران للحجز، دون الحاجة إلى تسليم أو استلام تذاكر ورقية مما يوفر سهولة الاستخدام والسرعة في عمليات الحجز و المزيد من المرونة في تعديل الحجز أو إلغائه. يتعين على المسافر طباعة ايصال التذكرة الإلكترونية التي يتم ارسالها على البريد الالكتروني، واصطحابها مع جواز السفر عند دخول المطار وإبرازها عند إتمام إجراءات السفر.`
                  },
               ],
            },
            {
               title: "تغيير الحجز",
               items: [
                  {
                     title: "ما هي التذكرة الالكترونية ؟",
                     desc: `التذاكر الإلكترونية هي التذاكر التي يتم فيها تخزين تفاصيل بيانات الحجز والتي تحتوي على (اسم ورقم جواز ومسار رحلة وتفاصيل الدفع الخاصة بكل مسافر) بشكل آمن في نظام شركة الطيران للحجز، دون الحاجة إلى تسليم أو استلام تذاكر ورقية مما يوفر سهولة الاستخدام والسرعة في عمليات الحجز و المزيد من المرونة في تعديل الحجز أو إلغائه. يتعين على المسافر طباعة ايصال التذكرة الإلكترونية التي يتم ارسالها على البريد الالكتروني، واصطحابها مع جواز السفر عند دخول المطار وإبرازها عند إتمام إجراءات السفر.`
                  },
               ],
            },
         ]
      },
      {
         id: 2,
         name: "شاليهات+",
         items: [
            {
               title: "مسائل متعلقة بالحجز",
               items: [
                  {
                     title: "ما هي التذكرة الالكترونية ؟",
                     desc: `التذاكر الإلكترونية هي التذاكر التي يتم فيها تخزين تفاصيل بيانات الحجز والتي تحتوي على (اسم ورقم جواز ومسار رحلة وتفاصيل الدفع الخاصة بكل مسافر) بشكل آمن في نظام شركة الطيران للحجز، دون الحاجة إلى تسليم أو استلام تذاكر ورقية مما يوفر سهولة الاستخدام والسرعة في عمليات الحجز و المزيد من المرونة في تعديل الحجز أو إلغائه. يتعين على المسافر طباعة ايصال التذكرة الإلكترونية التي يتم ارسالها على البريد الالكتروني، واصطحابها مع جواز السفر عند دخول المطار وإبرازها عند إتمام إجراءات السفر.`
                  },
                  {
                     title: "ما هي التذكرة الالكترونية ؟",
                     desc: `التذاكر الإلكترونية هي التذاكر التي يتم فيها تخزين تفاصيل بيانات الحجز والتي تحتوي على (اسم ورقم جواز ومسار رحلة وتفاصيل الدفع الخاصة بكل مسافر) بشكل آمن في نظام شركة الطيران للحجز، دون الحاجة إلى تسليم أو استلام تذاكر ورقية مما يوفر سهولة الاستخدام والسرعة في عمليات الحجز و المزيد من المرونة في تعديل الحجز أو إلغائه. يتعين على المسافر طباعة ايصال التذكرة الإلكترونية التي يتم ارسالها على البريد الالكتروني، واصطحابها مع جواز السفر عند دخول المطار وإبرازها عند إتمام إجراءات السفر.`
                  },
                  {
                     title: "ما هي التذكرة الالكترونية ؟",
                     desc: `التذاكر الإلكترونية هي التذاكر التي يتم فيها تخزين تفاصيل بيانات الحجز والتي تحتوي على (اسم ورقم جواز ومسار رحلة وتفاصيل الدفع الخاصة بكل مسافر) بشكل آمن في نظام شركة الطيران للحجز، دون الحاجة إلى تسليم أو استلام تذاكر ورقية مما يوفر سهولة الاستخدام والسرعة في عمليات الحجز و المزيد من المرونة في تعديل الحجز أو إلغائه. يتعين على المسافر طباعة ايصال التذكرة الإلكترونية التي يتم ارسالها على البريد الالكتروني، واصطحابها مع جواز السفر عند دخول المطار وإبرازها عند إتمام إجراءات السفر.`
                  },
               ],
            },
            {
               title: "إنجاز إجراءات السفر",
               items: [
                  {
                     title: "ما هي التذكرة الالكترونية ؟",
                     desc: `التذاكر الإلكترونية هي التذاكر التي يتم فيها تخزين تفاصيل بيانات الحجز والتي تحتوي على (اسم ورقم جواز ومسار رحلة وتفاصيل الدفع الخاصة بكل مسافر) بشكل آمن في نظام شركة الطيران للحجز، دون الحاجة إلى تسليم أو استلام تذاكر ورقية مما يوفر سهولة الاستخدام والسرعة في عمليات الحجز و المزيد من المرونة في تعديل الحجز أو إلغائه. يتعين على المسافر طباعة ايصال التذكرة الإلكترونية التي يتم ارسالها على البريد الالكتروني، واصطحابها مع جواز السفر عند دخول المطار وإبرازها عند إتمام إجراءات السفر.`
                  },
                  {
                     title: "ما هي التذكرة الالكترونية ؟",
                     desc: `التذاكر الإلكترونية هي التذاكر التي يتم فيها تخزين تفاصيل بيانات الحجز والتي تحتوي على (اسم ورقم جواز ومسار رحلة وتفاصيل الدفع الخاصة بكل مسافر) بشكل آمن في نظام شركة الطيران للحجز، دون الحاجة إلى تسليم أو استلام تذاكر ورقية مما يوفر سهولة الاستخدام والسرعة في عمليات الحجز و المزيد من المرونة في تعديل الحجز أو إلغائه. يتعين على المسافر طباعة ايصال التذكرة الإلكترونية التي يتم ارسالها على البريد الالكتروني، واصطحابها مع جواز السفر عند دخول المطار وإبرازها عند إتمام إجراءات السفر.`
                  },
                  {
                     title: "ما هي التذكرة الالكترونية ؟",
                     desc: `التذاكر الإلكترونية هي التذاكر التي يتم فيها تخزين تفاصيل بيانات الحجز والتي تحتوي على (اسم ورقم جواز ومسار رحلة وتفاصيل الدفع الخاصة بكل مسافر) بشكل آمن في نظام شركة الطيران للحجز، دون الحاجة إلى تسليم أو استلام تذاكر ورقية مما يوفر سهولة الاستخدام والسرعة في عمليات الحجز و المزيد من المرونة في تعديل الحجز أو إلغائه. يتعين على المسافر طباعة ايصال التذكرة الإلكترونية التي يتم ارسالها على البريد الالكتروني، واصطحابها مع جواز السفر عند دخول المطار وإبرازها عند إتمام إجراءات السفر.`
                  },
               ],
            },
            {
               title: "تصحيح الأسماء",
               items: [
                  {
                     title: "ما هي التذكرة الالكترونية ؟",
                     desc: `التذاكر الإلكترونية هي التذاكر التي يتم فيها تخزين تفاصيل بيانات الحجز والتي تحتوي على (اسم ورقم جواز ومسار رحلة وتفاصيل الدفع الخاصة بكل مسافر) بشكل آمن في نظام شركة الطيران للحجز، دون الحاجة إلى تسليم أو استلام تذاكر ورقية مما يوفر سهولة الاستخدام والسرعة في عمليات الحجز و المزيد من المرونة في تعديل الحجز أو إلغائه. يتعين على المسافر طباعة ايصال التذكرة الإلكترونية التي يتم ارسالها على البريد الالكتروني، واصطحابها مع جواز السفر عند دخول المطار وإبرازها عند إتمام إجراءات السفر.`
                  },
                  {
                     title: "ما هي التذكرة الالكترونية ؟",
                     desc: `التذاكر الإلكترونية هي التذاكر التي يتم فيها تخزين تفاصيل بيانات الحجز والتي تحتوي على (اسم ورقم جواز ومسار رحلة وتفاصيل الدفع الخاصة بكل مسافر) بشكل آمن في نظام شركة الطيران للحجز، دون الحاجة إلى تسليم أو استلام تذاكر ورقية مما يوفر سهولة الاستخدام والسرعة في عمليات الحجز و المزيد من المرونة في تعديل الحجز أو إلغائه. يتعين على المسافر طباعة ايصال التذكرة الإلكترونية التي يتم ارسالها على البريد الالكتروني، واصطحابها مع جواز السفر عند دخول المطار وإبرازها عند إتمام إجراءات السفر.`
                  },
                  {
                     title: "ما هي التذكرة الالكترونية ؟",
                     desc: `التذاكر الإلكترونية هي التذاكر التي يتم فيها تخزين تفاصيل بيانات الحجز والتي تحتوي على (اسم ورقم جواز ومسار رحلة وتفاصيل الدفع الخاصة بكل مسافر) بشكل آمن في نظام شركة الطيران للحجز، دون الحاجة إلى تسليم أو استلام تذاكر ورقية مما يوفر سهولة الاستخدام والسرعة في عمليات الحجز و المزيد من المرونة في تعديل الحجز أو إلغائه. يتعين على المسافر طباعة ايصال التذكرة الإلكترونية التي يتم ارسالها على البريد الالكتروني، واصطحابها مع جواز السفر عند دخول المطار وإبرازها عند إتمام إجراءات السفر.`
                  },
               ],
            },
            {
               title: "تغيير الحجز",
               items: [
                  {
                     title: "ما هي التذكرة الالكترونية ؟",
                     desc: `التذاكر الإلكترونية هي التذاكر التي يتم فيها تخزين تفاصيل بيانات الحجز والتي تحتوي على (اسم ورقم جواز ومسار رحلة وتفاصيل الدفع الخاصة بكل مسافر) بشكل آمن في نظام شركة الطيران للحجز، دون الحاجة إلى تسليم أو استلام تذاكر ورقية مما يوفر سهولة الاستخدام والسرعة في عمليات الحجز و المزيد من المرونة في تعديل الحجز أو إلغائه. يتعين على المسافر طباعة ايصال التذكرة الإلكترونية التي يتم ارسالها على البريد الالكتروني، واصطحابها مع جواز السفر عند دخول المطار وإبرازها عند إتمام إجراءات السفر.`
                  },
               ],
            },
         ]
      },
      {
         id: 3,
         name: "الرسوم",
         items: [
            {
               title: "مسائل متعلقة بالحجز",
               items: [
                  {
                     title: "ما هي التذكرة الالكترونية ؟",
                     desc: `التذاكر الإلكترونية هي التذاكر التي يتم فيها تخزين تفاصيل بيانات الحجز والتي تحتوي على (اسم ورقم جواز ومسار رحلة وتفاصيل الدفع الخاصة بكل مسافر) بشكل آمن في نظام شركة الطيران للحجز، دون الحاجة إلى تسليم أو استلام تذاكر ورقية مما يوفر سهولة الاستخدام والسرعة في عمليات الحجز و المزيد من المرونة في تعديل الحجز أو إلغائه. يتعين على المسافر طباعة ايصال التذكرة الإلكترونية التي يتم ارسالها على البريد الالكتروني، واصطحابها مع جواز السفر عند دخول المطار وإبرازها عند إتمام إجراءات السفر.`
                  },
                  {
                     title: "ما هي التذكرة الالكترونية ؟",
                     desc: `التذاكر الإلكترونية هي التذاكر التي يتم فيها تخزين تفاصيل بيانات الحجز والتي تحتوي على (اسم ورقم جواز ومسار رحلة وتفاصيل الدفع الخاصة بكل مسافر) بشكل آمن في نظام شركة الطيران للحجز، دون الحاجة إلى تسليم أو استلام تذاكر ورقية مما يوفر سهولة الاستخدام والسرعة في عمليات الحجز و المزيد من المرونة في تعديل الحجز أو إلغائه. يتعين على المسافر طباعة ايصال التذكرة الإلكترونية التي يتم ارسالها على البريد الالكتروني، واصطحابها مع جواز السفر عند دخول المطار وإبرازها عند إتمام إجراءات السفر.`
                  },
                  {
                     title: "ما هي التذكرة الالكترونية ؟",
                     desc: `التذاكر الإلكترونية هي التذاكر التي يتم فيها تخزين تفاصيل بيانات الحجز والتي تحتوي على (اسم ورقم جواز ومسار رحلة وتفاصيل الدفع الخاصة بكل مسافر) بشكل آمن في نظام شركة الطيران للحجز، دون الحاجة إلى تسليم أو استلام تذاكر ورقية مما يوفر سهولة الاستخدام والسرعة في عمليات الحجز و المزيد من المرونة في تعديل الحجز أو إلغائه. يتعين على المسافر طباعة ايصال التذكرة الإلكترونية التي يتم ارسالها على البريد الالكتروني، واصطحابها مع جواز السفر عند دخول المطار وإبرازها عند إتمام إجراءات السفر.`
                  },
               ],
            },
            {
               title: "إنجاز إجراءات السفر",
               items: [
                  {
                     title: "ما هي التذكرة الالكترونية ؟",
                     desc: `التذاكر الإلكترونية هي التذاكر التي يتم فيها تخزين تفاصيل بيانات الحجز والتي تحتوي على (اسم ورقم جواز ومسار رحلة وتفاصيل الدفع الخاصة بكل مسافر) بشكل آمن في نظام شركة الطيران للحجز، دون الحاجة إلى تسليم أو استلام تذاكر ورقية مما يوفر سهولة الاستخدام والسرعة في عمليات الحجز و المزيد من المرونة في تعديل الحجز أو إلغائه. يتعين على المسافر طباعة ايصال التذكرة الإلكترونية التي يتم ارسالها على البريد الالكتروني، واصطحابها مع جواز السفر عند دخول المطار وإبرازها عند إتمام إجراءات السفر.`
                  },
                  {
                     title: "ما هي التذكرة الالكترونية ؟",
                     desc: `التذاكر الإلكترونية هي التذاكر التي يتم فيها تخزين تفاصيل بيانات الحجز والتي تحتوي على (اسم ورقم جواز ومسار رحلة وتفاصيل الدفع الخاصة بكل مسافر) بشكل آمن في نظام شركة الطيران للحجز، دون الحاجة إلى تسليم أو استلام تذاكر ورقية مما يوفر سهولة الاستخدام والسرعة في عمليات الحجز و المزيد من المرونة في تعديل الحجز أو إلغائه. يتعين على المسافر طباعة ايصال التذكرة الإلكترونية التي يتم ارسالها على البريد الالكتروني، واصطحابها مع جواز السفر عند دخول المطار وإبرازها عند إتمام إجراءات السفر.`
                  },
                  {
                     title: "ما هي التذكرة الالكترونية ؟",
                     desc: `التذاكر الإلكترونية هي التذاكر التي يتم فيها تخزين تفاصيل بيانات الحجز والتي تحتوي على (اسم ورقم جواز ومسار رحلة وتفاصيل الدفع الخاصة بكل مسافر) بشكل آمن في نظام شركة الطيران للحجز، دون الحاجة إلى تسليم أو استلام تذاكر ورقية مما يوفر سهولة الاستخدام والسرعة في عمليات الحجز و المزيد من المرونة في تعديل الحجز أو إلغائه. يتعين على المسافر طباعة ايصال التذكرة الإلكترونية التي يتم ارسالها على البريد الالكتروني، واصطحابها مع جواز السفر عند دخول المطار وإبرازها عند إتمام إجراءات السفر.`
                  },
               ],
            },
            {
               title: "تصحيح الأسماء",
               items: [
                  {
                     title: "ما هي التذكرة الالكترونية ؟",
                     desc: `التذاكر الإلكترونية هي التذاكر التي يتم فيها تخزين تفاصيل بيانات الحجز والتي تحتوي على (اسم ورقم جواز ومسار رحلة وتفاصيل الدفع الخاصة بكل مسافر) بشكل آمن في نظام شركة الطيران للحجز، دون الحاجة إلى تسليم أو استلام تذاكر ورقية مما يوفر سهولة الاستخدام والسرعة في عمليات الحجز و المزيد من المرونة في تعديل الحجز أو إلغائه. يتعين على المسافر طباعة ايصال التذكرة الإلكترونية التي يتم ارسالها على البريد الالكتروني، واصطحابها مع جواز السفر عند دخول المطار وإبرازها عند إتمام إجراءات السفر.`
                  },
                  {
                     title: "ما هي التذكرة الالكترونية ؟",
                     desc: `التذاكر الإلكترونية هي التذاكر التي يتم فيها تخزين تفاصيل بيانات الحجز والتي تحتوي على (اسم ورقم جواز ومسار رحلة وتفاصيل الدفع الخاصة بكل مسافر) بشكل آمن في نظام شركة الطيران للحجز، دون الحاجة إلى تسليم أو استلام تذاكر ورقية مما يوفر سهولة الاستخدام والسرعة في عمليات الحجز و المزيد من المرونة في تعديل الحجز أو إلغائه. يتعين على المسافر طباعة ايصال التذكرة الإلكترونية التي يتم ارسالها على البريد الالكتروني، واصطحابها مع جواز السفر عند دخول المطار وإبرازها عند إتمام إجراءات السفر.`
                  },
                  {
                     title: "ما هي التذكرة الالكترونية ؟",
                     desc: `التذاكر الإلكترونية هي التذاكر التي يتم فيها تخزين تفاصيل بيانات الحجز والتي تحتوي على (اسم ورقم جواز ومسار رحلة وتفاصيل الدفع الخاصة بكل مسافر) بشكل آمن في نظام شركة الطيران للحجز، دون الحاجة إلى تسليم أو استلام تذاكر ورقية مما يوفر سهولة الاستخدام والسرعة في عمليات الحجز و المزيد من المرونة في تعديل الحجز أو إلغائه. يتعين على المسافر طباعة ايصال التذكرة الإلكترونية التي يتم ارسالها على البريد الالكتروني، واصطحابها مع جواز السفر عند دخول المطار وإبرازها عند إتمام إجراءات السفر.`
                  },
               ],
            },
            {
               title: "تغيير الحجز",
               items: [
                  {
                     title: "ما هي التذكرة الالكترونية ؟",
                     desc: `التذاكر الإلكترونية هي التذاكر التي يتم فيها تخزين تفاصيل بيانات الحجز والتي تحتوي على (اسم ورقم جواز ومسار رحلة وتفاصيل الدفع الخاصة بكل مسافر) بشكل آمن في نظام شركة الطيران للحجز، دون الحاجة إلى تسليم أو استلام تذاكر ورقية مما يوفر سهولة الاستخدام والسرعة في عمليات الحجز و المزيد من المرونة في تعديل الحجز أو إلغائه. يتعين على المسافر طباعة ايصال التذكرة الإلكترونية التي يتم ارسالها على البريد الالكتروني، واصطحابها مع جواز السفر عند دخول المطار وإبرازها عند إتمام إجراءات السفر.`
                  },
                  {
                     title: "ما هي التذكرة الالكترونية ؟",
                     desc: `التذاكر الإلكترونية هي التذاكر التي يتم فيها تخزين تفاصيل بيانات الحجز والتي تحتوي على (اسم ورقم جواز ومسار رحلة وتفاصيل الدفع الخاصة بكل مسافر) بشكل آمن في نظام شركة الطيران للحجز، دون الحاجة إلى تسليم أو استلام تذاكر ورقية مما يوفر سهولة الاستخدام والسرعة في عمليات الحجز و المزيد من المرونة في تعديل الحجز أو إلغائه. يتعين على المسافر طباعة ايصال التذكرة الإلكترونية التي يتم ارسالها على البريد الالكتروني، واصطحابها مع جواز السفر عند دخول المطار وإبرازها عند إتمام إجراءات السفر.`
                  },
                  {
                     title: "ما هي التذكرة الالكترونية ؟",
                     desc: `التذاكر الإلكترونية هي التذاكر التي يتم فيها تخزين تفاصيل بيانات الحجز والتي تحتوي على (اسم ورقم جواز ومسار رحلة وتفاصيل الدفع الخاصة بكل مسافر) بشكل آمن في نظام شركة الطيران للحجز، دون الحاجة إلى تسليم أو استلام تذاكر ورقية مما يوفر سهولة الاستخدام والسرعة في عمليات الحجز و المزيد من المرونة في تعديل الحجز أو إلغائه. يتعين على المسافر طباعة ايصال التذكرة الإلكترونية التي يتم ارسالها على البريد الالكتروني، واصطحابها مع جواز السفر عند دخول المطار وإبرازها عند إتمام إجراءات السفر.`
                  },
               ],
            },
         ]
      },
   ];
   const setting = {
      dots: false,
      infinite: false,
      centerMode: false,
      speed: 500,
      slidesToShow: 4,
      slidesToScroll: 1,
      initialSlide: categories[categories.length - 5]?.id,
      responsive: [
         {
            breakpoint: 1024,
            settings: {
               slidesToShow: 3,
               dots: true,
            }
         },
         {
            breakpoint: 640,
            settings: {
               slidesToShow: 2,
               dots: true,
            }
         }
      ]
   };
   // useEffect(() => {
   //    const cat = categories.find((category) => category.id === id);
   //    console.log(cat.items);
   // }, [id]);
   return (
      <>
         <Head>
            <title>الأسئلة الشائعة</title>
            <meta
               name="viewport"
               content="width=device-width, initial-scale=1"
            />
            <meta
               name="description"
               content={settings.meta_description}
            />
            <meta property="og:title" content="الأسئلة الشائعة" />
            <meta property="og:url" content="https://last-delta.vercel.app/" />
            <meta name="keywords" content={settings.keywords} />
            <meta
               property="og:description"
               content={settings.meta_description}
            />
            <meta name="twitter:title" content="الأسئلة الشائعة" />
            <meta
               name="twitter:description"
               content={settings.meta_description}
            />
         </Head>
         <div className="hidden md:block w-full bg-secondary h-36 md:h-40"></div>
         <div className="w-full h-[50vh] relative overflow-hidden flex">
            <Image src={"https://www.pmfurniture.com/blog/wp-content/uploads/2017/10/faqs.jpg"} alt="daleel" fill className='object-cover' />
            <div className="w-full h-full relative z-10 bg-gradient-to-t from-black/75 to-transparent text-white py-4 mt-auto">
               <div className="container h-full flex items-center justify-center">
                  <h1 className="text-xl md:text-3xl">الأسئلة الشائعة</h1>
               </div>
            </div>
         </div>
         <div className="container dark:text-white">
            <div className="border-b dark:border-gray-700">
               <Breadcrumbs list={[{ title: "الأسئلة الشائعة" }]} />
            </div>
            <p className="my-4">
               لديك أسئلة؟ هذه القائمة ستختصر عليك كثيرا من الوقت فهي تجيب على معظم استفساراتك. يمكنك الإطلاع على الأسئلة الشائعة هنا:
            </p>
            <Slider {...setting} className='w-full prog border-b dark:border-gray-700 my-10' dir="ltr">
               {categories.map((category) => {
                  return (
                     <button onClick={() => setId(category.id)} key={category.id} className={`text-xs transition duration-500 text-center hover:bg-gray-400/25 py-4 ${id === category.id ? "border-b-4 border-primary text-black dark:text-primary bold" : "text-gray-500 border-none font-light"}`}>{category.name}</button>
                  )
               })}
            </Slider>
            <div className="">
               {categories.find((category) => category.id === id).items.map((item, i) => {
                  return (
                     // <div key={i} className={`my-10 dark:border-gray-700 ${i != 0 ? "border-t" : "border-none"}`}>
                     //    <h2 className="text-xl my-4">{item.title}</h2>
                     //    <p className="text-sm text-justify text-gray-500 dark:text-gray-400">{item.desc}</p>
                     // </div>
                     <Accordion key={i} title={item.title} items={item.items} />
                  )
               })}
            </div>
         </div>
      </>
   )
}

export async function getServerSideProps() {
   const mainRes = await fetch("https://backendtwo.elnagahtravels.com/public/api/question").then((res) => res.json())

   const questions = mainRes;

   return { props: { questions } };
}

